<template>
  <div class="agreement">
    <header>
      <div class="return" @click="goBack()"></div>
      <p>淘儿学用户服务协议</p>
    </header>
    <div class="content">
      <p class="title">淘儿学用户服务协议</p>
      <p class="title">一、总则</p>
      <p>淘儿学APP的所有权和运营权归杭州尔学科技有限公司所有。用户
        在使用淘儿学的服务之前，应当仔细阅读本协议，并同意遵守本协
        议后方可成为淘儿学用户， 一旦用户注册成功，则用户与淘儿学之
        间自动形成协议关系，用户应当受本协议的约束。
      </p>
      <p>
        本协议的修改权归杭州尔学科技有限公司所有，对用户不承担通知
        义务。用户应当随时关注本协议的修改，并决定是否继续使用淘儿
        学提供的各项服务。
      </p>
      <p class="title">二、服务内容</p>
      <p>
        服务的具体内容由根据实际情况提供，例如淘儿学APP 、
        http://lanmao.uni-ubi.com
        等。除非本使用协议另有其它明确规
        定，增加或强化目前本服务的任何新功能，包括所推出的新产品，
        均受到本使用协议之规范。您了解并同意，本服务仅依其当前所呈
        现的状况提供，对于任何用户信息或个人化设定之时效、删除、传
        递错误、未予储存或其它任何问题，淘儿学均不承担任何责任。淘
        儿学保留不经事先通知为维修保养、升级或其它目的暂停本服务任
        何部分的权利。
      </p>
      <p class="title">三、遵守法律</p>
      <p>
        您同意遵守中华人民共和国相关法律法规的所有规定，并对以任何
        方式使用您的密码和您的账号使用本服务的任何行为及其结果承担
        全部责任。如您的行为违反国家法律和法规的任何规定，有可能构
        成犯罪的，将被追究刑事责任，并由您承担全部法律责任。如果淘
        儿学有理由认为您的任何行为，包括但不限于您的任何言论和其它
        行为违反或可能违反国家法律和法规的任何规定，淘儿学可在任何
        时候不经任何事先通知终止向您提供服务。
      </p>
      <p class="title">
        四、您的注册义务
      </p>
      <p>
        为了能使用本服务，您同意以下事项：依本服务注册提示填写正确
        的手机号码和密码。若您提供任何违法、 不道德或淘儿学认为不适
        合在淘儿学上展示的资料；或者淘儿学有理由怀疑你的资料属于程
        序或恶意操作，淘儿学有权暂停或终止您的账号，并拒绝您于现在
        和未来使用本服务之全部或任何部分。淘儿学无须对任何用户的任
        何登记资料承担任何责任，包括但不限于鉴别、核实任何登记资料
        的真实性、 正确性、完整性、适用性及是否为最新资料的责任。
      </p>
      <p class="title">
        五、隐私保护
      </p>
      <p>
        淘儿学不对外公开或向第三方提供单个用户的注册资料及用户在使
        用网络服务时存储在淘儿学的非公开内容，但下列情况除外：
        （1）事先获得用户的明确授权；
        （2）根据有关的法律法规要求；
        （3）按照相关政府主管部门的要求；
        （4）该第三方同意承担与××同等的保护用户隐私的责任；
      </p>
      <p class="title">
        六、附则
      </p>
      <p>
        本协议的订立、执行和解释及争议的解决均应适用中华人民共和国
        法律。如本协议中的任何条款无论因何种原因完全或部分无效或不
        具有执行力，本协议的其余条款仍应有效并且有约束力。
        本协议解释权及修订权归杭州尔学教育科技有限公司所有。
      </p>
    </div>
  </div>
</template>

<script>
  import router from "@/router/index";
  import "../../assets/style/personal-center/agreement.scss";
  export default{
    name: "Agreement",
    data(){
      return {}
    },
    methods: {
      goBack: function () {
        router.go(-1)
      }
    }
  }
</script>
